Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཆོས་མ་སྐྱེས་པ་རྣམས་ཀྱི་སྐྱེ་བ་མེད་པ་ཡང་བརྗོད་པར་སྤོབས་སམ་ཞེས་བྱ་བ་ལ་མ་སྐྱེས་པ་དང་སྐྱེ་བ་མེད་པ་ཞེས་བྱ་བའི་སྒྲ་གཉིས་ཀ་ཡང་དེ་བཞིན་ཉིད་ཀྱི་རྣམ་གྲངས་སུ་གྲགས་ཏེ།
en: You are also confident in your readiness to say there is no production of unproduced dharmas?” Both the terms “unproduced” and “no production” are well-known synonyms for suchness.

source: གང་གི་ཚེ་དེ་གཉིས་ཆོས་ཀྱི་སྒྲས་བྱེ་བྲག་ཏུ་ཕྱེ་ནས་མ་སྐྱེས་པའི་ཆོས་དང་། སྐྱེ་བ་མེད་པའི་ཆོས་ཞེས་བརྗོད་པ་དེའི་ཚེ།
en: When those two are differentiated as particulars qualifying the word “dharma”—“an unproduced dharma” and “a dharma of which there is no production”—they become words for falsely imagined dharmas.

source: ཀུན་བརྟགས་པའི་ཆོས་ཀྱི་ཚིག་ཏུ་འགྱུར་རོ། །ཅི་དེ་སྐད་བརྗོད་དུ་རུང་ངམ་ཞེས་དྲིས་པ་དེའི་ཚེ། གནས་བརྟན་རབ་འབྱོར་གྱིས་མ་སྐྱེས་པ་དང་། སྐྱེ་བ་མེད་པའི་སྒྲ་གཉིས་ཀུན་བརྟགས་པའི་ཚིག་ཏུ་ཡང་གྲགས་པ་ཡིན་ནམ་སྙམ་དུ་བསམས་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་མ་སྐྱེས་པའི་ཆོས་མ་སྐྱེས་པའི་ཆོས་ཞེས་བྱ་བར་བརྗོད་པའི་སྤོབས་པ་ཡང་བདག་ལ་མེད་དོ།
en: When asked if it is appropriate to say that, the elder Subhūti again, having thought about whether the two terms “unproduced” and “no production” are well known as falsely imagined words, says, “Venerable Śāriputra, I have no ready confidence to say again and again that dharmas are unproduced.

source: །ཆོས་མ་སྐྱེས་པ་རྣམས་ཀྱི་སྐྱེ་བ་མེད་པ་བརྗོད་པའི་སྤོབས་པ་ཡང་བདག་ལ་མེད་དོ་གསུངས་སོ།
en: I have no ready confidence to say there is no production of unproduced dharmas.”

source: །དེའི་འོག་ཏུ་མ་སྐྱེས་པ་དང་། སྐྱེ་བ་མེད་པ་གཉི་ག་ཡང་ཀུན་བརྟགས་པ་ཉིད་དུ་སྟོན་ཏེ། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་མ་སྐྱེས་པའི་ཆོས་གང་ཡིན་པ་དང་། སྐྱེ་བ་མེད་པ་གང་ཡིན་པ་དང་། སྤོབས་པ་གང་ཡིན་པ་དང་། བརྗོད་པ་གང་ཡིན་པ་དང་།
en: Then, teaching that the two—unproduced and no production—are just falsely imagined, it says, “And why?

source: མི་སྐྱེ་བ་གང་ཡིན་པའི་ཆོས་དེ་དག་ཐམས་ཅད་ཀྱང་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན། གཟུགས་མེད་པ། བསྟན་དུ་མེད་པ། ཐོགས་པ་མེད་པ་སྟེ། འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་དག་གོ་ཞེས་བྱ་བ་ནི་མ་སྐྱེས་པའི་ཆོས་དང་།
en: Because, Venerable Śāriputra, an unproduced dharma, nonproduction, ready confidence, saying something, and a state of production—all those dharmas are not conjoined and not disjoined, are formless, cannot be pointed out, do not obstruct, and have only one mark—that is, no mark.”

source: སྐྱེ་བ་མེད་པར་བརྗོད་པར་སྤོབས་སོ་ཞེས་བྱ་བའི་ཚིག་འདི་ལ་མ་སྐྱེས་པ་དང་། སྐྱེ་བ་མེད་པ་དང་། མི་སྐྱེ་བ་དང་། ཆོས་དང་སྤོབས་པ་དང་། བརྗོད་པ་ཞེས་བྱ་བའི་ཆོས་འདི་དྲུག་བསྟན་ཏོ།
en: In this statement about a ready confidence to say something about unproduced dharmas and no production, these six dharmas are indicated: unproduced, nonproduction, the absence of a state of production, a dharma, ready confidence, and saying something.

source: །དེ་དག་ཐམས་ཅད་ཀྱང་ཀུན་བརྟགས་པ་ཡིན་པས་མེད་པའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: That they are all falsely imagined and hence do not exist is the meaning.

source: །ཆོས་ཡོད་པ་ནི་སེམས་ལས་བྱུང་བའམ། སེམས་དང་མི་ལྡན་པའམ། གཟུགས་ཅན་ནམ། འདུས་མ་བྱས་པ་ཞིག་ཡིན་གྲང་ན།
en: You can suppose dharmas that exist are mental factors, not conjoined with mind, with form, or uncompounded.

source: དེ་ལ་ལྡན་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བས་ནི་སེམས་ལས་བྱུང་བའི་དངོས་པོར་ཡོད་པ་མ་ཡིན་པར་སྟོན་ཏོ། །མི་ལྡན་པ་ཡང་མ་ཡིན་ཞེས་བྱ་བས་ནི་སེམས་དང་མི་ལྡན་པའི་དངོས་པོར་ཡོད་པ་མ་ཡིན་པར་སྟོན་ཏོ། །གཟུགས་ཅན་མ་ཡིན་ཞེས་བྱ་བས་ནི་རྣམ་པར་རིག་བྱེད་མ་ཡིན་པ་ལ་སོགས་པ་གཟུགས་ཀྱི་ཆོས་བཅུ་གཅིག་པོ་ལྟར་གཟུགས་ཅན་གྱི་དངོས་པོར་ཡོད་པ་མ་ཡིན་པར་སྟོན་ཏོ། །བསྟན་དུ་མེད་པ་ཞེས་བྱ་བ་ནི་ཁ་དོག་བཞིན་དུ་བསྟན་དུ་ཡོད་པའི་དངོས་པོར་ཡོད་པ་མ་ཡིན་པར་སྟོན་ཏོ། །ཐོགས་པ་མེད་པ་ཞེས་བྱ་བས་ནི་དབང་པོའི་གཟུགས་ཀྱི་མཚན་ཉིད་དུ་ཡོད་པ་མ་ཡིན་པར་སྟོན་ཏོ།
en: There, “those dharmas are not conjoined” teaches that they do not exist as real mental factors; they “are not disjoined” teaches that they do not exist as real things not conjoined with mind; they “are formless” teaches that they do not exist as existent things with form like the eleven forms that are nonrevealing and so on; they “cannot be pointed out” teaches that they do not exist as things like colors that can be pointed out; they “do not block” teaches that they do not exist with the mark of the form of a sense faculty; and they “have only one mark—that is, no mark”—teaches that they do not exist with the mark of the uncompounded, which is to say, there is no dharma at all that is “the mark of the uncompounded.”

source: །འདི་ལྟར་མཚན་ཉིད་མེད་པར་མཚན་ཉིད་གཅིག་པ་དག་གོ་ཞེས་བྱ་བས་ནི་འདུས་མ་བྱས་པའི་མཚན་ཉིད་དུ་ཡོད་པ་མ་ཡིན་པར་སྟོན་ཏོ། །འདུས་མ་བྱས་པའི་མཚན་ཉིད་ཅེས་བྱ་བའི་ཆོས་ནི་གང་ཡང་མེད་དོ། །དེ་མེད་པས་ཡོད་པ་དང་མེད་པའི་མཚན་ཉིད་ལས་རྣམ་པར་གྲོལ་བའི་ཕྱིར་མཚན་ཉིད་མེད་པ་སྟེ་མཚན་ཉིད་མེད་པའི་མཚན་ཉིད་དུ་མཚན་ཉིད་གཅིག་པའོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means it does not exist, so they are liberated from the mark of existence and nonexistence and hence are without a mark, that is, they “have one mark”—marked by being without a mark.

source: །དེ་ནས་ཡང་གནས་བརྟན་ཤཱ་རིའི་བུས་ཅི་བརྗོད་པ་ལ་སོགས་པ་ཡང་མི་སྐྱེ་བའི་ངོ་བོ་ཉིད་ཡིན་ནམ་ཞེས་འདྲི་སྟེ།
en: Then the elder Śāriputra asks if saying something and so on are also nonproductions. “

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅི་བརྗོད་པ་ཡང་སྐྱེ་བ་མེད། སྤོབས་པ་ཡང་སྐྱེ་བ་མེད།
en: Venerable Subhūti, is there is no production of saying, is there also no production of ready confidence, and is there also no production of a dharma?

source: ཆོས་ཀྱང་སྐྱེ་བ་མེད་པ་གང་དག་ལས་བརྩམས་ཏེ་བརྗོད་པར་སྤོབས་པའི་ཆོས་དེ་དག་ཀྱང་སྐྱེ་བ་མེད་པ་ཡིན་ནམ་ཞེས་བྱ་བ་ནི་ཅི་བརྗོད་པ་དང་།
en: Are those dharmas that are the point of departure for a ready confidence to say something also not produced?”

source: སྤོབས་པ་དང་། ཆོས་དང་བརྗོད་པར་བྱ་བའི་ཆོས་ཐམས་ཅད་ཀྱང་སྐྱེ་བ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་ནམ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means: Do “saying,” “ready confidence,” and all “dharmas” and dharmas that have to be said have nonproduction as their intrinsic nature?

source: །དེ་ནས་གནས་བརྟན་རབ་འབྱོར་གྱིས་དེ་དེ་བཞིན་ནོ་ཞེས་བྱ་བ་ཐམས་ཅད་ཀྱང་སྐྱེ་བ་མེད་པའི་ངོ་བོ་ཉིད་ཡིན་པར་ཁས་ལེན་ཏེ།
en: Then the elder Subhūti says “exactly so,” asserting that they all have nonproduction as their intrinsic nature.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ་བརྗོད་པ་ནི་སྐྱེ་བ་མེད་པའོ། །སྤོབས་པ་ནི་སྐྱེ་བ་མེད་པའོ།
en: Having said, “There is no production of saying, there is also no production of ready confidence, and there is also no production of a dharma.

source: །ཆོས་ནི་སྐྱེ་བ་མེད་པའོ། །གང་དག་ལས་བརྩམས་ཏེ་བརྗོད་པར་སྤོབས་པའི་ཆོས་དེ་དག་ཀྱང་སྐྱེ་བ་མེད་པའོ་ཞེས་དེ་སྐད་བརྗོད་ནས། གཟུགས་སྐྱེ་བ་མེད་དོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཐམས་ཅད་ཀྱང་སྐྱེ་བ་མེད་པའི་ངོ་བོ་ཉིད་དུ་སྟོན་ཅིང་སྐྱེ་བ་མེད་པའི་འགྲེས་སྔར་བསྟན་པ་ཉིད་ཀྱང་སྟོན་ཏོ།
en: Those dharmas that are the point of departure for a ready confidence to say something are not produced,” with “there is no production of form,” and so on, it teaches that they all have nonproduction as their intrinsic nature, teaching just what has been taught before in the section on nonproduction.

source: །བསྟན་པ་འདི་ལ་ཡང་སྔར་སྨོས་པའི་སྐྱོན་འགྲོ་བ་ལྔ་པོ་དག་ཀྱང་ཐ་མི་དད་པར་འགྱུར་རོ་ཞེས་བྱ་བ་ལ་སོགས་པ་དེ་དྲན་པར་བྱས་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་འགྲོ་བ་ལྔ་པོ་རྣམས་ཀྱང་ཐ་མི་དད་པར་འགྱུར་རོ་ཞེས་ཟེར་བ་ནི་ཞེས་བྱ་བ་ལ་སོགས་པས་དེ་ལ་ལན་འདེབས་ཏེ།
en: Also, in this teaching it gives a reminder of the aforementioned faults—“in that case will the five forms of life not be differentiable” and so on—and gives a response to them.

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཇི་ལྟར་འཐོབ་པ་དང་། མངོན་པར་རྟོགས་པ་འཇིག་རྟེན་གྱི་ཐ་སྙད་དུ་ཡོད་པ་དེ་བཞིན་དུ་ཞེས་བྱ་བ་ནི་ཇི་ལྟར་དོན་དམ་པར་ཐོབ་པ་དང་མངོན་པར་རྟོགས་པ་གཉིས་མེད་པ་དང་། རྒྱུན་དུ་ཞུགས་པ་ལ་སོགས་པ་ཡང་མེད་པ་དེ་བཞིན་དུ་ཐེག་པ་གསུམ་པོ་དག་ཀྱང་དེ་བཞིན་ཉིད་ཙམ་དུ་ཟད་པའི་ཕྱིར་དོན་དམ་པར་འབྲས་བུ་ལ་བྱེ་བྲག་མེད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: As for “Venerable Śāriputra, just as attainment and clear realization exist as ordinary conventions, similarly,” and so on, it means “just as” ultimately both “attainment and clear realization” do not exist, and “stream enterer” and so on also do not exist, “similarly,” because the three vehicles are also simply just suchness, there are ultimately no differences in the results.

source: །འོ་ན་སྔོན་བསྐལ་པ་གྲངས་མེད་པ་གསུམ་དུ་ཚོགས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའི་ཚེ་ལས་ཀྱི་བྱེ་བྲག་ཀྱང་ཡོད་ལ་དེ་དང་རྗེས་སུ་མཐུན་པའི་རྣམ་པར་སྨིན་པའི་བྱེ་བྲག་དང་། དེ་བཞིན་དུ་འབྲས་བུའི་ཚེ་ཡང་ཉོན་མོངས་པ་དང་ཤེས་བྱའི་སྒྲིབ་པ་རྣམས་སྐྱེས་པ་དང་མ་སྐྱེས་པ་ལས་གྱུར་པའི་བྱེ་བྲག་དང་། དེ་དག་ཉིད་ཀྱི་དབང་གིས་ཀུན་ནས་ཉོན་མོངས་པ་དང་།
en: There are those who have gone wrong, thinking, “But earlier, when accumulating the accumulations during three incalculable eons, there are the particular different actions, there are particular different maturations corresponding to those, and similarly, during the result period there are different afflictive obscurations and obscurations to knowing that have been produced and not produced, so, based on just those, there are differences in defilement and purification.”

source: རྣམ་པར་བྱང་བ་ལས་གྱུར་པའི་བྱེ་བྲག་ཀྱང་ཡོད་དོ་ཞེས་ལོག་པར་ཞུགས་པ་རྣམས་ཀྱི་ཕྱིར་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟར་དོན་དམ་པར་ནི་ལས་ཀྱང་མེད། ལས་ཀྱི་རྣམ་པར་སྨིན་པ་ཡང་མེད། སྐྱེ་བ་ཡང་མེད། འགག་པ་ཡང་མེད། ཀུན་ནས་ཉོན་མོངས་པ་ཡང་མེད། རྣམ་པར་བྱང་བ་ཡང་མེད་དོ་ཞེས་གསུངས་ཏེ།
en: So it says, “Venerable Śāriputra, it is because ultimately there is no maturation of karma, there is no production, there is no cessation, there is no defilement, and there is no purification.”

source: འདི་དག་ཐམས་ཅད་ནི་ཀུན་བརྟགས་པ་སྟེ་ཡོད་པ་མ་ཡིན་པའོ། །དེ་བས་ན་དེ་དག་གི་དབང་གིས་དེ་བཞིན་ཉིད་ཐ་དད་དུ་མི་འགྱུར་རོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: This means they are all falsely imagined phenomena and do not exist, so suchness does not become different on account of them.

source: །དེ་ལྟར་མ་སྐྱེས་པ་བསྩལ་ནས། ཡང་སྐྱེ་བའི་ཆོས་བསྩལ་བའི་ཕྱིར་དྲི་བ་བརྩམས་ཏེ། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅི་མ་སྐྱེས་པའི་ཆོས་སྐྱེ་བར་འགྱུར་རམ། འོན་ཏེ་སྐྱེས་པའི་ཆོས་སྐྱེ་བར་འགྱུར་ཞེས་བྱ་བ་སྨོས་སོ།
en: Having thus eliminated an unproduced dharma, to eliminate a dharma that arises again it starts by asking a question: “Venerable Subhūti, is an unproduced dharma produced or is a produced dharma produced?”

source: །དེ་ལ་འདི་འདྲི་སྟེ། ཅི་གང་གི་ཚེ་ས་བོན་ལས་མྱུ་གུ་ལ་སོགས་པ་སྐྱེ་བའི་ཕྱིར། མྱུ་གུ་སྐྱེ་བ་དེ་མ་བྱུང་མ་སྐྱེས་པ་ཞིག་སྐྱེ་འམ། འོན་ཏེ་བྱུང་ཞིང་སྐྱེས་ཟིན་པ་ཞིག་སྐྱེ་ཞེས་བྱ་བའོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Here it is asking, given that a seedling and so on is produced from a seed, is that production of a seedling the production of one that has not come into being—is it “unproduced”—or is it the production of one that has come into being—is it already “produced”?

source: གལ་ཏེ་མྱུ་གུ་མ་སྐྱེས་པ་སྐྱེ་ན་ནི་མ་སྐྱེས་པ་ཐམས་ཅད་ཀྱང་ངེས་པ་མེད་པར་སྐྱེ་བར་འགྱུར་རོ། །གལ་ཏེ་སྐྱེས་ཟིན་པ་ཞིག་སྐྱེ་ན་ནི་ཡང་དང་ཡང་དུ་བཟླས་ཏེ། སྐྱེ་བར་འགྱུར་བ་ལ་སོགས་པ་རིགས་པ་དང་འགལ་བར་འགྱུར་བའི་ཕྱིར་གཉི་ག་ལྟར་ཡང་སྨྲར་མི་རུང་ནས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་བདག་ནི་མ་སྐྱེས་པའི་ཆོས་ཀྱང་སྐྱེ་བར་མི་འདོད། སྐྱེས་པའི་ཆོས་ཀྱང་སྐྱེ་བར་མི་འདོད་དོ་ཞེས་གནས་བརྟན་གྱིས་སྨྲས་ཏེ།
en: Having been asked that, the elder says that if an unproduced seedling is produced, everything unproduced would also be produced indeterminately, and if the already produced is produced, it would come to be produced repeatedly again and again, so, because being produced and so on is contradicted by these lines of reasoning, it is not appropriate to say it is like either: “Venerable Śāriputra, I do not accept that an unproduced dharma is produced, nor do I accept that a produced dharma is produced.”

source: མ་སྐྱེས་པ་ནི་མ་སྐྱེས་པ་ཉིད་ཀྱི་ཕྱིར་མེད་དེ་མེད་པ་ཉིད་ཀྱི་ཕྱིར་མི་སྐྱེའོ།
en: This means the unproduced does not exist because it is in a state of nonexistence, and because it is nonexistent it is not produced.

source: །སྐྱེས་པ་ཡང་སྐྱེས་ཟིན་པ་ཉིད་ཀྱི་ཕྱིར་ཡང་མི་སྐྱེ་སྟེ།
en: Furthermore, the produced, because it is already in a produced state, does not arise again.

source: དེ་བས་ན་དོན་དམ་པར་སྐྱེ་བའི་ཆོས་མེད་པ་ཉིད་དོ་ཞེས་བྱ་བའི་ཐ་ཚིག་གོ།
en: Ultimately, therefore, the attribute of arising is just nonexistent.

source: །དེ་སྐད་སྨྲས་པ་དང་འགའ་ཞིག་མ་སྐྱེས་པའི་ཆོས་རི་བོང་གི་རྭ་ལ་སྐྱེ་བ་མེད་དམ་སྐྱེས་པ་འདས་པ་རྣམས་ལ་སྐྱེ་བ་མེད་དམ་ཞེས་སྨྲར་འོང་ཞེས་དེའི་ཕྱིར།
en: Saying that prompts these questions: “Are certain unproduced attributes—a rabbit’s horns and so on—not produced? Or are past productions not produced?”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཁྱོད་མ་སྐྱེས་པའི་ཆོས་སྐྱེ་བར་མི་འདོད་པ་གང་ཡིན་ཞེས་བྱ་བ་དང་། སྐྱེས་པ་སྐྱེ་བར་མི་འདོད་པ་གང་ཡིན་ཞེས་བྱ་བའི་འགྲེས་གཉིས་དྲིས་སོ།
en: So there are these two questions: “Venerable Subhūti, what unproduced dharma do you not accept is produced?”

source: །ཡང་སྐྱེ་བ་བསྩལ་བའི་ཕྱིར།
en: and “What produced dharma do you not accept is produced?”

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ཅི་མ་སྐྱེས་པའི་ཆོས་སྐྱེ་བར་འགྱུར་རམ། འོན་ཏེ་སྐྱེས་པའི་ཆོས་སྐྱེ་བར་འགྱུར་ཞེས་དེ་སྐད་སྨྲས་པ་དང་། མི་སྐྱེ་བ་ནི་འདུས་མ་བྱས་པའི་ཕྱིར་མི་སྐྱེ་ལ། སྐྱེ་བ་ཡང་ཀུན་བརྟགས་པ་སྟེ། ཡོད་པ་མ་ཡིན་པའི་ཕྱིར་མི་སྐྱེ་བས་གནས་བརྟན་གྱིས།
en: To eliminate arising, again it says, “Venerable Subhūti, is a dharma that has not been produced, produced; or is a dharma that has been produced, produced?”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭི་ཏི་བུ་སྐྱེ་བ་ཡང་མི་སྐྱེ། མི་སྐྱེ་བ་ཡང་མི་སྐྱེའོ་ཞེས་བྱ་བ་གསུངས་པ་དེའི་གཏན་ཚིགས་སུ་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭི་ཏིའི་བུ་འདི་ལྟར་སྐྱེ་བ་གང་ཡིན་པ་དང་མི་སྐྱེ་བ་གང་ཡིན་པ་དེ་གཉིས་ཀ་ཡང་ལྡན་པ་ཡང་མ་ཡིན་མི་ལྡན་པ་ཡང་མ་ཡིན་ཏེ། མི་སྐྱེ་བ་ཉིད་དོ་ཞེས་བྱ་བ་ཡང་གསུངས་ཏེ།
en: A nonproduction is not produced because it is an uncompounded phenomenon, and a production is not produced because it is a falsely imagined phenomenon and does not exist, so the elder says, “Venerable Śāriputra, the unproduced is not produced, and the produced is not produced either,” and as the reason for that says, “Venerable Śāriputra, it is because both produced and unproduced dharmas are not conjoined and not disjoined because there is no production,” having in mind that both are nevertheless ultimately simply just suchness.

source: དེ་ལྟ་ཡིན་ཡང་གཉི་ག་ཡང་དོན་དམ་པར་དེ་བཞིན་ཉིད་ཙམ་དུ་ཟད་དོ་ཞེས་བྱ་བར་དགོངས་པའོ། །དེ་སྐད་བསྟན་ནས་སྐྱེ་བ་མེད་པའི་འགྲེས་སྔར་བསྟན་པ་ཉིད་ཀྱང་བསྟན་ཏེ།
en: Having taught that, it teaches just what has been taught before in the section on nonproduction.

source: དེ་ལྟར་ན་གཟུགས་སྐྱེ་བ་མེད་དོ་ཞེས་བྱ་བ་ནས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྐྱེ་བ་མེད་དོ་ཞེས་བསྟན་ནས།
en: Thus, there is the teaching from “there is no production of form,” up to “there is no production of the knowledge of all aspects.”

source: ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་རྣམ་གྲངས་འདིས་ན་བརྗོད་པ་ནི་སྐྱེ་བ་མེད་པ་སྟེ། སྤོབས་པ་ཡང་སྐྱེ་བ་མེད་ལ། ཆོས་ཀྱང་སྐྱེ་བ་མེད་དེ་གང་དག་ལས་བརྩམས་ཏེ་བརྗོད་པར་སྤོབས་པའི་ཆོས་དེ་དག་ཀྱང་སྐྱེ་བ་མེད་པའོ་ཞེས་མཇུག་བསྡུས་སོ།
en: It sums up in conclusion with, “Venerable Śāriputra, because of this one of many explanations, there is no production of saying, there is also no production of ready confidence, and there is also no production of a dharma; those dharmas that are the point of departure for a ready confidence to say something are not produced.” “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་གཟུགས་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ་ཞེས་བྱ་བ་ནི་ཆོས་ཉིད་ཀྱི་གཟུགས་བསྟན་པ་སྟེ། དེ་བས་ན་དེ་ནི་ནང་ན་ཡང་མི་གནས་ཕྱི་རོལ་ན་ཡང་མི་གནས། གཉིས་ཀ་མེད་པར་ཡང་མི་དམིགས་སོ་ཞེས་བྱ་བ་གསུངས་སོ།
en: Venerable Śāriputra, form is empty of a basic nature” teaches the true dharmic nature of form, so it says, “It has no fixed position inside, it has no fixed position outside, and it cannot be apprehended without both.”

source: །གལ་ཏེ་དེ་འགའ་ཞིག་ལ་གནས་ན་ནང་ངམ་ཕྱི་རོལ་ལམ། གཉི་ག་ལས་གཞན་འགའ་ཞིག་ལ་གནས་གྲང་ན།
en: Were it to have a “fixed position” in something, you can suppose it would have a fixed position either “inside, outside,” or in something other than “both.”

source: འདི་ལྟར་དེ་གསུམ་ཆར་ལ་ཡང་དོན་དམ་པར་མེད་དེ། དེ་བས་ན་མི་གནས་པའོ།
en: Because ultimately it does not exist in all three, therefore “it has no fixed position.”

source: །དེ་སྐད་བསྟན་ནས་གནས་པ་དང་མི་གནས་པ་དེ་ཉིད་ཀྱི་མཚན་ཉིད་ལེགས་པར་རྒྱ་བསྐྱེད་དེ་བྱང་ཆུབ་ཀྱི་ལམ་ཡོངས་སུ་སྤྱད་པའི་ཐབས་སྟོན་ཏེ། འཇིག་རྟེན་པ་ཡང་ཡོད་འཇིག་རྟེན་ལས་འདས་པ་ཡང་ཡོད་ཅེས་བྱ་བ་ལ་སོགས་པའོ།
en: Having taught that, it elaborates excellently the marks of just that fixed position and no fixed position and teaches the means to “purify the awakening path” with “there is an ordinary… and there is an extraordinary” one and so on. “

source: །འཇིག་རྟེན་ལས་མི་གཡོ་མི་འཕགས་མི་འདའ་ཞེས་པ་བྱ་དེ་ཀུན་བརྟགས་པ་ལས་ཞེས་བྱ་བའི་ཐ་ཚིག་སྟེ།
en: It does not move from, does not transcend, and does not pass beyond the ordinary world,” beyond falsely imagined phenomena.

source: བཟོད་པ་ཆུང་ངུ་དང་འབྲིང་དང་ཆེན་པོའི་དབང་གིས་རྣམ་པ་གསུམ་མོ།
en: The three are based on the small, middling, and big forbearance.

source: །གང་དག་གིས་འཇིག་རྟེན་དུ་འགྱུར་བ་ཞེས་བྱ་བ་ལ་སོགས་པའི་ཚིག་བདུན་ནི་དེ་ལ་ཁ་ཅིག་ཏུ་ནི་འཇིག་རྟེན་གྱི་སྒྲ་ཕུང་པོ་ལྔ་ལ་བྱ། ཁ་ཅིག་ཏུ་ནི་སེམས་ཅན་གྱི་འཇིག་རྟེན། ཁ་ཅིག་ཏུ་ནི་སྣོད་ཀྱི་འཇིག་རྟེན། ཁ་ཅིག་ཏུ་ནི་སོ་སོའི་སྐྱེ་བོའི་འཇིག་རྟེན། ཁ་ཅིག་ཏུ་ནི་འཁོར་བ། ཁ་ཅིག་ཏུ་ནི་ཀུན་བརྟགས་པའི་ཆོས་རྣམས། ཁ་ཅིག་ཏུ་ནི་འདོད་པའི་ཡོན་ཏན་ལྔ་རྣམས་ལ་བྱ་སྟེ།
en: As for the seven statements “as which the world (as subject) exists,” and so on, there in some places the word world is to be taken as the five aggregates;in some places it is to be taken as the world as inhabitants;in some places the container world;in some places the world of ordinary beings;in some places the cycle of existences;in some places falsely imagined dharmas; andin some places as the five sorts of sense object. “

source: གང་དག་གིས་འཇིག་རྟེན་དུ་འགྱུར་བ་ཞེས་བྱ་བ་ནི་ཕུང་པོའི་འཇིག་རྟེན་ནོ། །གང་དག་འཇིག་རྟེན་འགྲུབ་པར་བྱེད་པ་ཞེས་བྱ་བ་ནི་སྣོད་ཀྱི་འཇིག་རྟེན་ནོ། །གང་དག་འཇིག་རྟེན་དང་མཉམ་པ་ཞེས་བྱ་བ་ནི་ཀུན་བརྟགས་པའི་ཆོས་རྣམས་དང་མཉམ་པའོ། །གང་དག་གིས་འཇིག་རྟེན་གྱི་ཕྱིར་སྦྱིན་པ་ཞེས་བྱ་བ་ནི་འདོད་པའི་ཡོན་ཏན་ལྔ་འཇིག་རྟེན་གྱི་ཕྱིར་སྦྱིན་པའོ། །གང་དག་གིས་འཇིག་རྟེན་ལས་འབྱུང་བར་མི་འགྱུར་བ་ཞེས་བྱ་བ་ནི་འཁོར་བའི་འཇིག་རྟེན་ལས་སོ། །གང་དག་འཇིག་རྟེན་འབྱུང་བར་འགྱུར་བ་ཞེས་བྱ་བ་ནི་སོ་སོའི་སྐྱེ་བོའི་འཇིག་རྟེན་ཏེ།
en: On account of them the world is here”— the world as aggregates; “on account of them the world is established”— the container world; “the world is the same as them”— the same as falsely imagined phenomena; “on account of them there is something given to the world”— the five sorts of sense objects are given to the world; “on account of them they do not escape the world”— from the world that is the cycle of existences; “they are for the coming into being of the world”— the world as ordinary beings, because to come into being is to increase; and “they come into being in the world”— the world as inhabitants comes into being in the container world. “

source: འབྱུང་བ་ནི་འཕེལ་བའི་ཕྱིར་རོ། །གང་དག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་བ་ཞེས་བྱ་བ་ནི་སྣོད་ཀྱི་འཇིག་རྟེན་དུ་སེམས་ཅན་གྱི་འཇིག་རྟེན་འབྱུང་ངོ་། །གང་དག་གིས་འཇིག་རྟེན་སྒྲོལ་བ་ཞེས་བྱ་བ་ནི་སེམས་ཅན་གྱི་འཇིག་རྟེན་ནོ། །གང་དག་འཇིག་རྟེན་སེལ་བར་བྱེད་པ་ཞེས་བྱ་བ་ནི་འདོད་པའི་ཡོན་ཏན་ལྔ་རྣམས་སོ། །འཇིག་རྟེན་གྱིས་གང་དག་གིས་སྒྲོལ་བར་བྱེད་པ་ཞེས་བྱ་བ་ནི་འཕགས་པའི་གང་ཟག་གི་འཇིག་རྟེན་གྱིས་སོ།
en: On account of them the world goes free”— the world as inhabitants; “they eliminate the world”— the five sorts of sense objects; “on account of them a world causes an escape”— the world as a superior person.

source: །གང་དག་འཇིག་རྟེན་མ་ཡིན་པར་འགྱུར་ཞེས་བྱ་བ་ནི་ཡོངས་སུ་གྲུབ་པར་འགྱུར་བའོ།
en: As for “those that are not the world”— these are thoroughly established phenomena.

source: །གང་དག་གིས་འཇིག་རྟེན་ལས་འབྱུང་བར་འགྱུར་བ་ཞེས་བྱ་བ་ནི་འཁོར་བའི་འཇིག་རྟེན་ལས་འབྱུང་བའོ།
en: As for “the world from which they will escape”— they escape from the world of the cycle of existences.

source: །གང་དག་འཇིག་རྟེན་ལས་སྒྲོལ་བ་ཞེས་བྱ་བ་ནི་སྣོད་ཀྱི་འཇིག་རྟེན་ལས་སོ། །གང་དག་འཇིག་རྟེན་དུ་སྒྲོལ་བར་བྱེད་པ་ཞེས་བྱ་བ་ནི་ཆོས་ཀྱི་འཇིག་རྟེན་རྣམས་སུའོ།
en: As for “those who free from the world”— this is from the container world; as for “those who free in the world”— this is in the worlds where there is Dharma. “

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལེགས་སོ་ལེགས་སོ།
en: Excellent, excellent, Venerable Śāriputra.

source: །ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས་ཡང་དག་པའི་ཚིག་བརྗོད་པས་དོན་ཉིད་ཡོངས་སུ་བཟུང་བ་ནི་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་དམིགས་སུ་ཕེབས་སོ་ཞེས་བྱ་བ་ནི་ཤཱ་རིའི་བུའི་ཚིག་ལ་ཚིག་རྣམ་པ་གསུམ་གྱིས་རྗེས་སུ་ཡི་རང་བའི་ཚིག་སྟེ།
en: I will object to Venerable Śāriputra in that Venerable Śāriputra has got at just what is meant by expressing the statement as an absolute.” This is a statement, stated in three parts, rejoicing in what Śāriputra has said.

source: ལེགས་ཤིང་རིགས་པས་དམིགས་སུ་ཕེབས་པར་དོན་ཡོངས་སུ་བཟུང་ངོ་ཞེས་སྟོན་ཏོ།
en: It teaches that it is excellent, that there are logical objections to it, and that it has got at the meaning. “

source: །སེམས་ཅན་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་མེད་པར་རིག་པར་བྱའོ། །སེམས་ཅན་སྟོང་པ་ཉིད་ཀྱི་ཕྱིར་ཡིད་ལ་བྱེད་པ་སྟོང་པ་ཉིད་དུ་རིག་པར་བྱའོ། །སེམས་ཅན་དབེན་པ་ཉིད་ཀྱི་ཕྱིར་ཡིད་ལ་བྱེད་པ་དབེན་པ་ཉིད་དུ་རིག་པར་བྱའོ། །སེམས་ཅན་ངོ་བོ་ཉིད་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་ངོ་བོ་ཉིད་མེད་པར་རིག་པར་བྱའོ།
en: You should know that the nonexistence of attention is because of the nonexistence of a being; you should know that the emptiness of attention is because of the emptiness of a being; you should know that the isolation of attention is because of the isolation of a being; you should know that the absence of an intrinsic nature in attention is because of the absence of an intrinsic nature in a being; and you should know that there is no full awakening of attention because there is no full awakening of a being.”

source: །སེམས་ཅན་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མེད་པའི་ཕྱིར་ཡིད་ལ་བྱེད་པ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་མེད་པར་རིག་པར་བྱའོ་ཞེས་བྱ་བ་ཡིད་ལ་བྱེད་པ་དེ་ལྟ་དེ་ལས་གཞན་པ་རྣམས་ལ་མེད་དེ་དེ་བས་ན་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་མ་ཡིན་ནོ་ཞེས་བསྟན་པ་ཡིན་ནོ།
en: There are no other than those five attentions so it is teaching that they too are not the bodhisattva.

source: །དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གནས་པ་འདི་དང་། ཡིད་ལ་བྱེད་པ་འདི་དང་མ་བྲལ་ལོ་ཞེས་བདག་སྨྲའོ་ཞེས་བསྟན་ཏོ།
en: Therefore, it teaches: “I say bodhisattva great beings are not separated from staying in this state or from this attention.”

source: །དེ་ལྟར་རེ་ཞིག་ཆོ་འཕྲུལ་བསྟན་པ་དང་བཅས། འབྲས་བུ་བསྟན་པ་དང་བཅས་པར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འབྲིང་དུ་བཤད་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་པ་ཡིན་ནོ།
en: Explanation of the Detailed Teaching Part One Explanation of Chapters 22 and 23 Thus, first of all, along with a teaching of miraculous powers and along with a teaching of the results, the intermediate explanation of the perfection of wisdom has been completed.

source: །དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིས་མདོ་དང་འབྲིང་དང་རྒྱས་པ་རྣམ་པ་གསུམ་དུ་བསྟན་ཏོ་ཞེས་བཤད་དེ།
en: As explained, the Tathāgata in this perfection of wisdom gives a threefold teaching: brief, middling, and detailed.

source: དེ་ལ་འདུལ་བའི་དབང་གིས་མདོ་དང་འབྲིང་གི་ཚུལ་གཉིས་ནི་བསྟན་ཟིན་ཏོ།
en: Of them, the teaching in brief and middling modes based on trainees is finished.

source: །འདི་མན་ཆད་ནི་འདུལ་བའི་འགྲོ་བའི་ཡོངས་སུ་མ་སྨིན་པ་རྣམས་ཀྱི་ཐེ་ཚོམ་སྐྱེས་ཤིང་སྐྱེས་པ་རྣམས་བསལ་བས་ཡོངས་སུ་སྨིན་པར་བྱས་ནས་ཡོངས་སུ་སྨིན་པ་རྣམས་དེ་ཁོ་ན་ཉིད་ཀྱི་དོན་རྟོགས་པར་བྱེད་པ་ཀུན་རྫོབ་དང་དོན་དམ་པའི་ཚུལ་རྣམ་པར་དབྱེ་བས་རྒྱས་པ་རྣམ་པ་གཉིས་སུ་བསྟན་ཏེ།
en: From here on, having brought unmatured trainees to maturity by removing doubts that have arisen, a detailed teaching in two parts, divided into the conventional and ultimate modes, causes those who have been brought to maturity to realize the meaning of true reality.

source: དེ་ནས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་རྒྱལ་པོ་ཆེན་པོ་གང་དག་འཁོད་པ་དེ་དག་ཐམས་ཅད་དང་། ལྷའི་བུ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་ལྷན་ཅིག་ཏུ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏོ་ཞེས་བྱ་བ་ལ་སོགས་པས་ཅིའི་ཕྱིར་ལྷ་རྣམས་འདུས་པར་ཡང་བསྟན་ལ།
en: Then, “all the Four Mahārājas stationed in the great billion world systems together with many hundreds of thousands of one hundred million billion gods were assembled in that very retinue,” and so on.

source: དེ་བཞིན་གཤེགས་པའི་མཐུ་བརྗོད་པའི་སྐབས་ནི་གང་ཡིན་ཞེ་ན།
en: Why is it also teaching that they are all assembled on the occasion of a discourse powered by the Tathāgata?
